Repository: don-zabi/Sale_Alert_Buddy
Catalog: Sale_Alert_Buddy/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans

# action.addItem
source: Add Item
ja: 商品を追加
zh_hans: 添加商品

# action.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消

# action.delete
source: Delete
ja: 削除
zh_hans: 删除

# action.pause
source: Pause
ja: 一時停止
zh_hans: 暂停

# action.resume
source: Resume
ja: 再開
zh_hans: 恢复

# action.save
source: Save
ja: 保存
zh_hans: 保存

# addItem.category.pickExisting
source: Choose Existing Category
ja: 既存カテゴリから選択
zh_hans: 从已有分类中选择

# addItem.category.placeholder
source: Optional category
ja: カテゴリ（任意）
zh_hans: 分类（可选）

# addItem.error.fetch
source: Failed to check existing items.
ja: 既存の商品を確認できませんでした。
zh_hans: 无法检查现有商品。

# addItem.error.notificationValue
source: Enter a valid notification value greater than 0.
ja: 0より大きい有効な通知値を入力してください。
zh_hans: 请输入大于 0 的有效通知值。

# addItem.error.planLimit
source: Free plan limit reached (20 items). Upgrade to track more products.
ja: 無料プランの上限（20件）に達しました。アップグレードするとより多くの商品を追跡できます。
zh_hans: 已达到免费版上限（20件）。升级后可追踪更多商品。

# addItem.error.title
source: Registration Failed
ja: 登録失敗
zh_hans: 注册失败

# addItem.memo.placeholder
source: Optional note…
ja: メモ（任意）…
zh_hans: 备注（可选）…

# addItem.pasteURL
source: Paste from Clipboard
ja: クリップボードから貼り付け
zh_hans: 从剪贴板粘贴

# addItem.register
source: Register & Check
ja: 登録して確認
zh_hans: 注册并检查

# addItem.registering
source: Checking price…
ja: 価格を確認中…
zh_hans: 正在检查价格…

# addItem.section.category
source: Category (optional)
ja: カテゴリ（任意）
zh_hans: 分类（可选）

# addItem.section.notes
source: Notes (optional)
ja: メモ（任意）
zh_hans: 备注（可选）

# addItem.section.tags
source: Tags (optional)
ja: タグ（任意）
zh_hans: 标签（可选）

# addItem.section.url
source: Product URL
ja: 商品URL
zh_hans: 商品链接

# addItem.tags.hint
source: Separate tags with commas.
ja: タグはカンマで区切ってください。
zh_hans: 用逗号分隔标签。

# addItem.tags.placeholder
source: tag1, tag2
ja: タグ1, タグ2
zh_hans: 标签1, 标签2

# addItem.title
source: Add Item
ja: 商品を追加
zh_hans: 添加商品

# app.title
source: Sale Alert Buddy
ja: セールアラート
zh_hans: 特卖提醒

# currency.jpy.unit
source: JPY
ja: 円
zh_hans: 日元

# detail.action.buy
source: Buy Now
ja: 購入する
zh_hans: 立即购买

# detail.action.checkNow
source: Check Now
ja: 今すぐ確認
zh_hans: 立即检查

# detail.action.delete.confirm
source: Delete this item?
ja: この商品を削除しますか？
zh_hans: 删除该商品？

# detail.action.delete.message
source: This item and all its price history will be permanently removed.
ja: この商品と価格履歴がすべて削除されます。この操作は元に戻せません。
zh_hans: 该商品及其所有价格历史记录将被永久删除。

# detail.action.openSafari
source: Open in Safari
ja: Safariで開く
zh_hans: 在Safari中打开

# detail.action.pause
source: Pause Monitoring
ja: 監視を一時停止
zh_hans: 暂停监控

# detail.action.resume
source: Resume Monitoring
ja: 監視を再開
zh_hans: 恢复监控

# detail.category.none
source: No Category
ja: カテゴリなし
zh_hans: 无分类

# detail.error.title
source: Error
ja: エラー
zh_hans: 错误

# detail.lastUpdated
source: Last updated %@
ja: %@に更新
zh_hans: 更新于 %@

# detail.noChecks
source: No checks yet.
ja: まだ確認していません。
zh_hans: 尚无检查记录。

# detail.notify.currentSetting
source: Current setting:
ja: 現在の設定：
zh_hans: 当前设置：

# detail.notify.targetCalc
source: → Notify at %@ or below
ja: → %@ 以下になったら通知します
zh_hans: → 价格降至 %@ 以下时通知

# detail.notifyThreshold
source: Notify when ≥ %@ off
ja: ≥ %@ の値下がりで通知
zh_hans: 降价 ≥ %@ 时通知

# detail.notifyThreshold.amount
source: Notify when drop amount is %@ or more
ja: 値下げ額が %@ 以上で通知
zh_hans: 降价金额达到 %@ 或以上时通知

# detail.notifyThreshold.invalidValue
source: Enter a valid number greater than 0.
ja: 0より大きい有効な数値を入力してください。
zh_hans: 请输入大于 0 的有效数字。

# detail.notifyThreshold.percent
source: Notify when drop is %@%% or more
ja: 値下げ率が %@%% 以上で通知
zh_hans: 降价幅度达到 %@%% 或以上时通知

# detail.notifyThreshold.save
source: Save Notification Rule
ja: 通知ルールを保存
zh_hans: 保存通知规则

# detail.notifyThreshold.saved
source: Changes saved
ja: 変更しました
zh_hans: 已保存

# detail.notifyThreshold.target
source: Notify when price is %@ or below
ja: 価格が %@ 以下で通知
zh_hans: 价格低于或等于 %@ 时通知

# detail.notifyThreshold.type
source: Condition Type
ja: 条件タイプ
zh_hans: 条件类型

# detail.notifyThreshold.value
source: Value
ja: 値
zh_hans: 数值

# detail.priceTrend.empty
source: Price history will appear after two or more successful checks.
ja: 2回以上チェックに成功すると価格推移が表示されます。
zh_hans: 成功检查两次及以上后将显示价格走势。

# detail.section.category
source: Category
ja: カテゴリ
zh_hans: 分类

# detail.section.notification
source: Notification
ja: 通知
zh_hans: 通知

# detail.section.price
source: Price
ja: 価格
zh_hans: 价格

# detail.section.priceTrend
source: Price Trend
ja: 価格推移
zh_hans: 价格走势

# detail.section.recentChecks
source: Recent Checks
ja: 最近の確認
zh_hans: 最近检查

# detail.section.status
source: Status
ja: ステータス
zh_hans: 状态

# error.extraction
source: Price not found in page
ja: ページ内で価格を見つけられませんでした
zh_hans: 未在页面中找到价格

# error.http4xx
source: Access blocked (4xx)
ja: アクセスが拒否されました（4xx）
zh_hans: 访问被阻止（4xx）

# error.http5xx
source: Server error (5xx)
ja: サーバーエラー（5xx）
zh_hans: 服务器错误（5xx）

# error.network
source: Network error
ja: ネットワークエラー
zh_hans: 网络错误

# languagePicker.confirm
source: Continue
ja: 続ける
zh_hans: 继续

# languagePicker.subtitle
source: Select your preferred language
ja: 表示言語を選んでください
zh_hans: 请选择您偏好的语言

# languagePicker.title
source: Choose Language
ja: 言語を選択
zh_hans: 选择语言

# list.category.add
source: New Category
ja: カテゴリを追加
zh_hans: 添加分类

# list.category.add.title
source: New Category
ja: 新しいカテゴリ
zh_hans: 新建分类

# list.category.all
source: All
ja: すべて
zh_hans: 全部

# list.category.delete
source: Delete
ja: 削除
zh_hans: 删除

# list.category.delete.confirm
source: This category will be removed from all items.
ja: このカテゴリはすべての商品から削除されます。
zh_hans: 该分类将从所有商品中移除。

# list.category.delete.title
source: Delete Category?
ja: カテゴリを削除しますか？
zh_hans: 删除分类？

# list.category.edit
source: Rename
ja: 名前を変更
zh_hans: 重命名

# list.category.edit.title
source: Rename Category
ja: カテゴリ名を変更
zh_hans: 重命名分类

# list.category.filter
source: Filter by Category
ja: カテゴリで絞り込み
zh_hans: 按分类筛选

# list.category.name.placeholder
source: Category name
ja: カテゴリ名
zh_hans: 分类名称

# list.category.showLess
source: Less
ja: 閉じる
zh_hans: 收起

# list.category.showMore
source: More…
ja: もっと見る
zh_hans: 更多

# list.empty.description
source: Tap + to add a product URL.
ja: ＋をタップして商品URLを追加
zh_hans: 点击 + 添加商品链接

# list.empty.title
source: No items yet
ja: 商品がありません
zh_hans: 暂无商品

# notification.priceDrop.title
source: %@ Price Drop
ja: %@ が値下がりしました
zh_hans: %@ 已降价

# notify.condition.amount
source: Drop Amount
ja: 値下げ額
zh_hans: 降价金额

# notify.condition.percentage
source: Drop Rate
ja: 値下げ率
zh_hans: 降价比例

# notify.condition.short.amount
source: ¥ Off
ja: 値下げ額
zh_hans: 降价

# notify.condition.short.percentage
source: % Off
ja: 値下げ率
zh_hans: 折扣%

# notify.condition.short.targetPrice
source: Target
ja: 目標価格
zh_hans: 目标价

# notify.condition.targetPrice
source: Target Price
ja: 指定価格以下
zh_hans: 价格低于或等于

# pauseReason.failures
source: Paused after repeated fetch failures
ja: 取得失敗が続いたため一時停止
zh_hans: 因连续抓取失败已暂停

# pauseReason.planLimit
source: Paused: free plan limit (upgrade to add more)
ja: 無料プラン上限のため一時停止（アップグレードで追加可能）
zh_hans: 因达到免费版上限已暂停（升级后可继续添加）

# pauseReason.user
source: Manually paused
ja: 手動で一時停止
zh_hans: 手动暂停

# priceCheckError.duplicateURL
source: This URL is already being tracked.
ja: このURLはすでに追跡中です。
zh_hans: 该 URL 已在追踪列表中。

# priceCheckError.fetchFailed
source: Failed to fetch the page: %@
ja: ページの取得に失敗しました: %@
zh_hans: 获取页面失败：%@

# priceCheckError.invalidURL
source: The URL is invalid or could not be normalized.
ja: URLが無効か、正規化できませんでした。
zh_hans: URL 无效或无法规范化。

# priceCheckError.priceNotFound
source: Could not find a price on the page.
ja: ページ内で価格を見つけられませんでした。
zh_hans: 无法在页面中找到价格。

# settings.about.build
source: Build
ja: ビルド
zh_hans: 构建版本

# settings.about.version
source: Version
ja: バージョン
zh_hans: 版本

# settings.backgroundRefresh.info
source: Sale Alert Buddy checks prices when you open the app. Background refresh is best-effort and depends on iOS system conditions.
ja: アプリを開いたときに価格を確認します。バックグラウンド更新はiOSのシステム状況により異なります。
zh_hans: 打开应用时会检查价格。后台刷新取决于iOS系统状况。

# settings.language.current
source: Language
ja: 言語
zh_hans: 语言

# settings.notifications.authorized
source: Enabled
ja: 有効
zh_hans: 已启用

# settings.notifications.denied
source: Disabled
ja: 無効
zh_hans: 已禁用

# settings.notifications.ephemeral
source: Ephemeral
ja: 一時的
zh_hans: 临时

# settings.notifications.notDetermined
source: Not set
ja: 未設定
zh_hans: 未设置

# settings.notifications.openSettings
source: Open Notification Settings
ja: 通知設定を開く
zh_hans: 打开通知设置

# settings.notifications.provisional
source: Provisional
ja: 暫定
zh_hans: 临时授权

# settings.notifications.status
source: Status
ja: ステータス
zh_hans: 状态

# settings.notifications.unknown
source: Unknown
ja: 不明
zh_hans: 未知

# settings.plan.current
source: Current Plan
ja: 現在のプラン
zh_hans: 当前套餐

# settings.plan.free
source: Free (20 items)
ja: 無料（20件）
zh_hans: 免费版（20件）

# settings.plan.upgradeNote
source: Upgrade coming soon — track up to 50 items.
ja: アップグレード近日公開 — 最大50件追跡可能。
zh_hans: 升级版即将推出 — 最多追踪50件商品。

# settings.section.about
source: About
ja: このアプリについて
zh_hans: 关于

# settings.section.backgroundRefresh
source: Background Refresh
ja: バックグラウンド更新
zh_hans: 后台刷新

# settings.section.language
source: Language
ja: 言語
zh_hans: 语言

# settings.section.notifications
source: Notifications
ja: 通知
zh_hans: 通知

# settings.section.plan
source: Plan
ja: プラン
zh_hans: 套餐

# settings.title
source: Settings
ja: 設定
zh_hans: 设置

# status.ok
source: Active
ja: 監視中
zh_hans: 监控中

# status.paused
source: Paused
ja: 一時停止
zh_hans: 已暂停

# status.tempFailed
source: Check Failed
ja: チェック失敗
zh_hans: 检查失败

# time.never
source: Never
ja: なし
zh_hans: 从未

# action.ok
source: OK
zh_hans: 好
